src/cf/Catalogs/ПрофилиДолжностей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ПрофилиДолжностей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехническиеНавыки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Навык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЛичныеНавыки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Навык</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФункциональныеОбязанности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обязанность</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыКомпетенций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыКомпетенций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Профессиональные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Универсальные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обязанность</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ПрофилиДолжностей/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПодборКомпетенций(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Универсальные"), "ПодборКомпетенцийЛичные");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПодборКомпетенцийТехнические(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Профессиональные"), "ПодборКомпетенцийТехнические");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКомпетенцийФункциональные(Команда)
	
	ПодборОбщее(ПредопределенноеЗначение("Перечисление.ТипыКомпетенций.Обязанность"), "ПодборКомпетенцийФункциональные");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборОбщее(ТипКомпетенции, ПараметрПодбора)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("ТипКомпетенции", ТипКомпетенции);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", ПараметрыОтбора);
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	ПараметрыФормы.Вставить("МножественныйВыбор", Истина);
	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма, ПараметрПодбора);
	
	ОткрытьФорму("Справочник.Компетенции.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , ОбработкаВыбора);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДопПараметры = "ПодборКомпетенцийЛичные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл
			НоваяСтрока = Объект.ЛичныеНавыки.Добавить();
			НоваяСтрока.Навык = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийФункциональные" Тогда
		Для Каждого ЭлементМассива Из Значение Цикл 
			НоваяСтрока = Объект.ФункциональныеОбязанности.Добавить();
			НоваяСтрока.Обязанность = ЭлементМассива;
		КонецЦикла;
		
	ИначеЕсли ДопПараметры = "ПодборКомпетенцийТехнические" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Компетенция.Ссылка КАК Навык,
		|	Компетенция.Родитель КАК РодительЭлемента
		|ИЗ
		|	Справочник.Компетенции КАК Компетенция
		|ГДЕ
		|	Компетенция.Ссылка В(&Ссылка)
		|ИТОГИ ПО
		|	Родитель";
		Запрос.УстановитьПараметр("Ссылка", Значение);
		ПромДерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ОбходДереваДетально(ПромДерево);
		ЗначениеВРеквизитФормы(ПромДерево, "ТехническиеНавыкиДерево");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбходДереваДетально(ПереданноеДер)
	
	Для Каждого СтрПолученногоДерева Из ПереданноеДер.Строки Цикл
		Если НЕ ТипЗнч(СтрПолученногоДерева.Навык) <> Тип("СправочникСсылка.Компетенции") Тогда
			СтрПолученногоДерева.РодительЭлемента = Справочники.Компетенции.ПустаяСсылка();
		КонецЕсли;
		
		Если СтрПолученногоДерева.Строки.Количество() > 0 Тогда
			ОбходДереваДетально(СтрПолученногоДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	Компетенции.Родитель КАК Родитель
	//	|ИЗ
	//	|	Справочник.Компетенции КАК Компетенции
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиДолжностей.ТехническиеНавыки КАК ПрофилиДолжностейТехническиеНавыки
	//	|		ПО (ПрофилиДолжностейТехническиеНавыки.Навык = Компетенции.Ссылка)";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	//
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	//	СтрокаДерева = ТехническиеНавыкиДерево.Строки.Добавить();
	//	СтрокаДерева.Навык = ВыборкаДетальныеЗаписи.Родитель;
	//КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	//Для каждого Строка Из ТехническиеНавыкиДерево.Строки Цикл
	//	РекурсивноеЗаполнениеТаблицыЗначений(Строка);
	//КонецЦикла;
	
	//ДанныеДерева = РеквизитФормыВЗначение("ТехническиеНавыкиДерево");
	//РекурсивноеЗаполнениеТаблицыЗначений(ДанныеДерева)
	
КонецПроцедуры

&НаСервере
Процедура РекурсивноеЗаполнениеТаблицыЗначений(СтрокаДерева)
	
	//Для Каждого Строка Из СтрокаДерева.Строки Цикл
	//	НовыйЭлемент = Объект.ТехническиеНавыки.Добавить();
	//	НовыйЭлемент.Навык = Строка.Навык;
	//	Если Строка.Строки.Количество() > 0 Тогда
	//		РекурсивноеЗаполнениеТаблицыЗначений(Строка);
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры
